#    -*- mode: org -*-


Archived entries from file /Users/darrellbanks/Dropbox/darrellbanks.com/org/tasks/inbox.org


** DONE Add component for personalized description :work:
:LOGBOOK:
CLOCK: [2024-01-17 Wed 10:39]--[2024-01-17 Wed 11:04] =>  0:25
CLOCK: [2024-01-17 Wed 10:09]--[2024-01-17 Wed 10:34] =>  0:25
:END:
Added: [2024-01-17 Wed 10:02]

** DONE Test component for personalized description :work:
:LOGBOOK:
CLOCK: [2024-01-18 Thu 10:11]--[2024-01-18 Thu 10:36] =>  0:25
:END:
Added: [2024-01-17 Wed 10:05]

** DONE Update frontend question type references :work:
:LOGBOOK:
CLOCK: [2024-01-24 Wed 10:38]--[2024-01-24 Wed 11:03] =>  0:25
CLOCK: [2024-01-24 Wed 10:03]--[2024-01-24 Wed 10:28] =>  0:25
CLOCK: [2024-01-23 Tue 10:16]--[2024-01-23 Tue 10:20] =>  0:04
:END:
Added: [2024-01-23 Tue 09:48]

** DONE Start the product image component :work:
:LOGBOOK:
CLOCK: [2024-01-25 Thu 12:25]--[2024-01-25 Thu 12:50] =>  0:25
CLOCK: [2024-01-25 Thu 09:59]--[2024-01-25 Thu 10:24] =>  0:25
CLOCK: [2024-01-25 Thu 09:53]--[2024-01-25 Thu 09:58] =>  0:05
:END:
Added: [2024-01-23 Tue 09:47]
* DONE Add images to frontend build :work: 
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-04 Sun 15:14
:ARCHIVE_FILE: ~/Dropbox/darrellbanks.com/org/tasks/inbox.org
:ARCHIVE_OLPATH: 2024/2024-01 January/2024-01-26 Friday
:ARCHIVE_CATEGORY: inbox
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-01-26 Fri 10:46]--[2024-01-26 Fri 11:11] =>  0:25
CLOCK: [2024-01-26 Fri 10:09]--[2024-01-26 Fri 10:34] =>  0:25
:END:
Added: [2024-01-26 Fri 10:05]

* DONE Add progress bar component :work: 
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-04 Sun 15:14
:ARCHIVE_FILE: ~/Dropbox/darrellbanks.com/org/tasks/inbox.org
:ARCHIVE_OLPATH: 2024/2024-01 January/2024-01-29 Monday
:ARCHIVE_CATEGORY: inbox
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-01-29 Mon 13:39]--[2024-01-29 Mon 13:49] =>  0:10
CLOCK: [2024-01-29 Mon 10:50]--[2024-01-29 Mon 11:15] =>  0:25
:END:
Added: [2024-01-29 Mon 09:44]

* DONE Add illustrations to frontend build :work: 
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-04 Sun 15:15
:ARCHIVE_FILE: ~/Dropbox/darrellbanks.com/org/tasks/inbox.org
:ARCHIVE_OLPATH: 2024/2024-01 January/2024-01-31 Wednesday
:ARCHIVE_CATEGORY: inbox
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-01-31 Wed 10:56]--[2024-01-31 Wed 11:36] =>  0:40
CLOCK: [2024-01-30 Tue 10:11]--[2024-01-30 Tue 10:51] =>  0:40
:END:
Added: [2024-01-29 Mon 13:49]

* DONE Create image rotator component :work: 
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-04 Sun 15:15
:ARCHIVE_FILE: ~/Dropbox/darrellbanks.com/org/tasks/inbox.org
:ARCHIVE_OLPATH: 2024/2024-02 February/2024-02-01 Thursday
:ARCHIVE_CATEGORY: inbox
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-02-01 Thu 10:39]--[2024-02-01 Thu 11:19] =>  0:40
CLOCK: [2024-02-01 Thu 09:50]--[2024-02-01 Thu 10:30] =>  0:40
CLOCK: [2024-01-31 Wed 14:14]--[2024-01-31 Wed 14:54] =>  0:40
CLOCK: [2024-01-31 Wed 14:02]--[2024-01-31 Wed 14:06] =>  0:04
:END:
Added: [2024-01-31 Wed 13:52]

* DONE Create the loading state component :work: 
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-04 Sun 15:16
:ARCHIVE_FILE: ~/Dropbox/darrellbanks.com/org/tasks/inbox.org
:ARCHIVE_OLPATH: 2024/2024-02 February/2024-02-02 Friday
:ARCHIVE_CATEGORY: inbox
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-02-02 Fri 13:15]--[2024-02-02 Fri 13:55] =>  0:40
CLOCK: [2024-02-02 Fri 10:40]--[2024-02-02 Fri 11:20] =>  0:40
:END:
Added: [2024-02-02 Fri 09:41]

** DONE Fix bug in editor block placement :lambda: 
:LOGBOOK:
CLOCK: [2024-02-05 Mon 19:11]--[2024-02-05 Mon 19:51] =>  0:40
:END:
Added: [2024-02-05 Mon 19:10]
Adding a 'focusout' event listener and setting the most recent
block index state allowed for tracking the entry point.
** DONE Fix broken CSS :work: 
:LOGBOOK:
CLOCK: [2024-02-08 Thu 11:39]--[2024-02-08 Thu 12:19] =>  0:40
:END:
Added: [2024-02-08 Thu 11:38]

* DONE Fix multiple asset placements in preamp :work: 
:PROPERTIES:
:ARCHIVE_TIME: 2024-02-12 Mon 16:56
:ARCHIVE_FILE: ~/Dropbox/darrellbanks.com/org/tasks/inbox.org
:ARCHIVE_OLPATH: 2024/2024-02 February/2024-02-12 Monday
:ARCHIVE_CATEGORY: inbox
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2024-02-12 Mon 11:28]--[2024-02-12 Mon 11:37] =>  0:09
CLOCK: [2024-02-12 Mon 10:37]--[2024-02-12 Mon 11:17] =>  0:40
:END:
Added: [2024-02-12 Mon 10:33]

** DONE Fix scroll problem :work: 
:LOGBOOK:
CLOCK: [2024-02-14 Wed 10:41]--[2024-02-14 Wed 11:21] =>  0:40
:END:
Added: [2024-02-14 Wed 09:26]

** DONE Start max retry logic work :work: 
:LOGBOOK:
CLOCK: [2024-02-16 Fri 11:19]--[2024-02-16 Fri 11:22] =>  0:03
CLOCK: [2024-02-16 Fri 10:13]--[2024-02-16 Fri 10:53] =>  0:40
:END:
Added: [2024-02-14 Wed 09:27]
** DONE Results screen functionality work :work: 
:LOGBOOK:
CLOCK: [2024-02-20 Tue 11:07]--[2024-02-20 Tue 11:47] =>  0:40
CLOCK: [2024-02-20 Tue 10:12]--[2024-02-20 Tue 10:52] =>  0:40
CLOCK: [2024-02-19 Mon 14:13]--[2024-02-19 Mon 14:53] =>  0:40
CLOCK: [2024-02-19 Mon 13:24]--[2024-02-19 Mon 14:05] =>  0:41
:END:
Added: [2024-02-19 Mon 09:48]

*** DONE Add animations to loading and results transition :work: 
:LOGBOOK:
CLOCK: [2024-02-22 Thu 10:10]--[2024-02-22 Thu 10:48] =>  0:38
:END:
Added: [2024-02-22 Thu 09:50]
*** TODO Add question config request functionality :work: 
:LOGBOOK:
CLOCK: [2024-02-26 Mon 10:19]--[2024-02-26 Mon 10:59] =>  0:40
CLOCK: [2024-02-23 Fri 15:19]--[2024-02-23 Fri 15:40] =>  0:21
CLOCK: [2024-02-23 Fri 14:30]--[2024-02-23 Fri 15:10] =>  0:40
CLOCK: [2024-02-23 Fri 13:34]--[2024-02-23 Fri 14:14] =>  0:40
:END:
Added: [2024-02-22 Thu 09:51]
** TODO Fix end_chat state :work: 
:LOGBOOK:
CLOCK: [2024-03-01 Fri 10:44]--[2024-03-01 Fri 11:24] =>  0:40
:END:
Added: [2024-03-01 Fri 10:20]
** DONE Update all image paths in config :work: 
:LOGBOOK:
CLOCK: [2024-03-05 Tue 11:03]--[2024-03-05 Tue 11:06] =>  0:03
CLOCK: [2024-03-05 Tue 10:08]--[2024-03-05 Tue 10:48] =>  0:40
:END:
Added: [2024-03-05 Tue 09:46]
** DONE Add markdown support to chatbot :work: 
:LOGBOOK:
CLOCK: [2024-03-11 Mon 13:59]--[2024-03-11 Mon 14:39] =>  0:40
:END:
Added: [2024-03-11 Mon 13:58]

** DONE Rework preamp infinite scroll logic :work: 
:LOGBOOK:
CLOCK: [2024-03-15 Fri 14:04]--[2024-03-15 Fri 14:45] =>  0:41
CLOCK: [2024-03-15 Fri 10:05]--[2024-03-15 Fri 10:45] =>  0:40
:END:
Added: [2024-03-15 Fri 10:04]

** DONE Connect to recommendation middleware :work: 
:LOGBOOK:
CLOCK: [2024-03-19 Tue 10:52]--[2024-03-19 Tue 11:32] =>  0:40
:END:
Added: [2024-03-19 Tue 10:14]

** DONE Update mock configs :work: 
:LOGBOOK:
CLOCK: [2024-03-29 Fri 10:04]--[2024-03-29 Fri 10:44] =>  0:40
:END:
Added: [2024-03-29 Fri 09:56]

*** DONE Update mock configs :work: 
:LOGBOOK:
CLOCK: [2024-03-29 Fri 10:04]--[2024-03-29 Fri 10:44] =>  0:40
:END:
Added: [2024-03-29 Fri 09:56]

** DONE Add chat error handling :work: 
:LOGBOOK:
CLOCK: [2024-04-01 Mon 10:29]--[2024-04-01 Mon 11:04] =>  0:35
:END:
Added: [2024-03-29 Fri 09:56]
** DONE Add chat error handling :work: 
:LOGBOOK:
CLOCK: [2024-04-01 Mon 10:29]--[2024-04-01 Mon 11:04] =>  0:35
:END:
Added: [2024-03-29 Fri 09:56]
